Repository: ZawilaP/FlutterHackathon
Catalog: badambadam/lib/l10n/app_*.arb
Languages: pl

# helloWorld
source: Dear Parents,
pl: Szanowni Państwo,

# entryText
source: We know that you have the best knowledge about your children. Most of your observations are about your children's skills and interests and are a reason for joy. However, there may be times when you could be concerned about your child's development. Then it is worth checking if there is indeed a reason for concern. We give you the M-CHAT-R tool, which was created to assess the risk of autism spectrum. It allows for a preliminary assessment of the child in terms of his social development and communication skills. In most cases, if there are any developmental abnormalities, they only require visits to a speech therapist or simple exercises at home. Only a small percentage of the children examined require further diagnosis towards the autism spectrum. For these children, this is a chance for faster therapy. Therefore, we encourage you to complete the online questionnaire. Remember that it is always worth clarifying doubts so that nothing disrupts the adventure of exploring the world with our Little One. The Modified Checklist for Autism in Toddlers (M-CHAT-R), related materials, and all information about their possible use are available at https://www.mchatscreen.com. The M-CHAT-R tool is intended for children aged 16 to 30 months. Completing the questionnaire for younger children will give false results, as they may not yet have mastered many skills that older children have. We encourage parents of younger children (between 12 and 18 months of age) to familiarize themselves with the list of developmental skills corresponding to this age: http://badabada.pl/dla-rodzicow/rozwoj-dziecka.
pl: wiemy, że to właśnie Rodzice mają najlepsze intuicje, co do rozwoju swoich dzieci. Większość ich spostrzeżeń dotyczy umiejętności oraz zainteresowań dzieci i jest powodem do radości. Czasem, jako rodzice, mamy jednak także jakieś intuicje i obserwacje budzące nasz niepokój. Zawsze warto je rozwiać, żeby nic nie burzyło przygody, jaką jest wspólne odkrywania świata z naszym Maluchem. Oddajemy w Państwa ręce narzędzie M-CHAT-R, które zostało stworzone w celu oceny ryzyka wystąpienia zaburzeń ze spektrum autyzmu i pozwala na wstępną ocenę prawidłowości rozwoju dziecka w zakresie rozwoju społecznego oraz umiejętności komunikowania się. W większości przypadków, jeśli nawet występują jakieś nieprawidłowości rozwojowe, kończą się one wizytami u logopedy lub prostymi ćwiczeniami w zaciszu domowym. Tylko 1% badanych dzieci wymaga dalszej diagnostyki i terapii w kierunku zaburzeń ze spektrum autyzmu. Dla tych dzieci jest to szansa na szybszą pomoc. Zachęcamy więc do wypełnienia kwestionariusza, szczególnie, że można to zrobić w najbardziej wygodnym dla siebie czasie i miejscu, ze względu na dostępność badania online. The Modified Checklist for Autism in Toddlers (M-CHAT-R), powiązane z nim materiały oraz wszelkie informacje o możliwości ich użytkowania dostępne są na stronie www.mchatscreen.com Narzędzie M-CHAT-R przeznaczone jest dla dzieci w wieku 16 do 30 miesięcy. Wypełnienie kwestionariusza dla dzieci młodszych niż 16 miesięcy da nieprawdziwe wyniki, gdyż mają one prawo nie opanować jeszcze wielu umiejętności, jakie posiadają dzieci starsze. Rodziców młodszych dzieci (pomiędzy 12 a 18 miesiącem życia) zachęcamy do zapoznania się z listą umiejętności rozwojowych odpowiadających temu wiekowi: https://badabada.pl/dla-rodzicow/155-rozwoj-dziecka-miedzy-12-18-mz By wziąć udział w ankiecie podaj datę urodzenia swojego dziecka:

# birthPlaceholder
source: Select date of birth of your child
pl: Wybierz datę urodzin swojego dziecka

source: YES
pl: TAK

source: NO
pl: NIE

# surveyStart
source: Start the survey
pl: Rozpocznij ankietę

# dateInput1
source: Input the date in format yyyy-mm-dd.
pl: Wprowadź datę w formacie rrrr-mm-dd.

# dateInput2
source: Your child's age should be between 16 and 30 months.
pl: Dziecko powinno mieć między 16 a 30 miesięcy.

source: Loading...
pl: Ładowanie...

# zipCodeFormat
source: Please provide your postal code (for example 01-234)
pl: Podaj kod pocztowy (np. 01-234)

# answerEveryQuestion
source: Please answer every question!
pl: Proszę odpowiedzieć na każde pytanie!

source: Close
pl: Zamknij

# changesWontBeSaved
source: Changes won't be saved, do you want to continue?
pl: Zmiany nie zostaną zapisane, czy chcesz kontynuować?

# providePostalCode
source: Please provide the postal code
pl: Proszę podać kod pocztowy

# childGender
source: What is the gender of the child?
pl: Jaka jest płeć dziecka?

source: Male
pl: Męska

source: Female
pl: Żeńska

# chooseGender
source: Choose the child's gender
pl: Wybierz płeć dziecka

source: Who is filling the survey?
pl: Kim jest wypełniający badanie?

source: Father
pl: Ojciec

source: Mother
pl: Matka

source: Grandpa
pl: Dziadek

source: Grandma
pl: Babcia

# otherFromFamily
source: Other person from the family
pl: Inna osoba z rodziny

source: Legal guardian
pl: Opiekun prawny

source: Someone else
pl: Inna osoba

# choosePerson
source: Choose a person
pl: Wybierz osobę

# whichPregnancyWeek
source: Child born in which pregnancy week?
pl: Dziecko urodzone w tygodniu ciąży

# chooseWeek
source: Choose a week
pl: Wybierz tydzień

# birthWeight
source: Please provide the child's birth weight (in grams)
pl: Proszę podać wagę urodzeniową dziecka (w gramach)

# geneticDiseases
source: Does the child have any genetic diseases?
pl: Czy dziecko ma choroby genetyczne?

# healthIssues
source: Does the child have any serious health issues?
pl: Czy dziecko ma poważne problemy zdrowotne?

# visionIssues
source: Does the child have any serious vision issues?
pl: Czy dziecko ma poważne problemy ze wzrokiem?

# hearingIssues
source: Does the child have any serious hearing issues?
pl: Czy dziecko ma poważne problemy ze słuchem?

# mobilityIssues
source: Does the child have any mobility development issues?
pl: Czy dziecko ma problemy w rozwoju ruchowym?

# mobilityRehab
source: Has the child been in mobility rehabilitation?
pl: Czy dziecko jest/było rehabilitowane ruchowo?

# skillsIssues
source: Has the child ever withdrawn from acquired skills for a period longer than 2 weeks?
pl: Czy kiedykolwiek dziecko wycofało się ze zdobytych umiejętności na okres dłuższy niż 2 tygodnie?

# autismSigns
source: Does anyone in the family have diagnosed autism spectrum disorder?
pl: Czy ktoś w rodzinie ma zdiagnozowane zaburzenie ze spektrum autyzmu?

source: Question
pl: Pytanie

# provideCorrectPostalCode
source: Please enter a correct postal code (e.g., 01-234)
pl: Podaj kod pocztowy (np. 01-234)

# weightAtBirth
source: Child's weight at birth
pl: Waga urodzeniowa dziecka

# weightMustBeCorrect
source: Weight must not be negative and should not exceed 10 kg
pl: Waga nie może być ujemna i przekraczać 10kg

# familyMemberAutismInformation
source: Who has a diagnosed autism spectrum disorder?
pl: Kto ma zdiagnozowane spektrum autyzmu?

# familyAutismSigns
source: Does the indicated person/people have diagnosed autism?
pl: Czy wskazana osoba/wskazane osoby ma/mają zdiagnozowany autyzm?

# familyAtypicalAutismSigns
source: Does the indicated person/people have diagnosed atypical autism?
pl: Czy wskazana osoba/wskazane osoby ma/mają zdiagnozowany autyzm atypowy?

# familyAspergerAutismSigns
source: Does the indicated person/people have diagnosed Asperger's syndrome?
pl: Czy wskazana osoba/wskazane osoby ma/mają zdiagnozowany Zespół Aspergera?

# familyDevelopmentIssues
source: Does the indicated person/people have diagnosed pervasive developmental disorders?
pl: Czy wskazana osoba/wskazane osoby ma/mają zdiagnozowany całościowe zaburzenia rozwojowe?

# familyOtherAutismSigns
source: Does the indicated person/people have diagnosed other autism spectrum disorders?
pl: Czy wskazana osoba/wskazane osoby ma/mają zdiagnozowane inne zaburzenia ze spektrum autyzmu?

# proceedToSurvey
source: Proceed to the survey
pl: Prejdź do badania

# sisterOne
source: Sister (first)
pl: Siostra (pierwsza)

# sisterTwo
source: Sister (second)
pl: Siostra (druga)

# sisterThree
source: Sister (third)
pl: Siostra (trzecia)

# brotherOne
source: Brother (first)
pl: Brat (pierwszy)

# brotherTwo
source: Brother (second)
pl: Brat (drugi)

# brotherThree
source: Brother (third)
pl: Brat (trzeci)

source: Who is the other person?
pl: Kim jest inna osoba?

source: Submit answers
pl: Zatwierdź odpowiedzi

# hasToAnswer1
source: Please respond YES or NO to every question.
pl: Proszę odpowiedzieć TAK lub NIE na każde pytanie.

# hasToAnswer2
source: Think about how your child behaves on a daily basis.
pl: Proszę pomyśleć o tym, w jaki sposób dziecko zachowuje się na codzień.

# hasToAnswer3
source: Answer NO if you saw a behaviour several times but the child usually behaves differently
pl: Jeśli widział/a Pan/Pani zachowanie kilka razy, ale dziecko zwykle się tak nie zachowuje, proszę zaznaczyć NIE.

# somethingWrong
source: Something went wrong. Please return to the home page.
pl: Coś poszło nie tak. Proszę wrócić do strony głównej.

# noRiskIntro
source: We are very pleased to inform you that your child's development in the area of ​​social-communicative skills does not raise concern. There is a low risk of autism spectrum.
pl: Jest nam bardzo miło poinformować, że rozwój Twojego Malucha w zakresie umiejętności społeczno-komunikacyjnych nie budzi niepokoju. Istnieje niskie ryzyko wystąpienia spektrum autyzmu.

# smallRiskIntro
source: We would like to inform you that your child's examination shows some developmental abnormalities that indicate a medium risk of autism spectrum in your child.
pl: Chcielibyśmy poinformować, że badanie Twojego Malucha wykazuje pewne nieprawidłowości w zakresie rozwoju, które wskazują na średnie ryzyko występowania spektrum autyzmu u Twojego dziecka.

# bigRiskIntro
source: We would like to inform you that your child's development is atypical and the test result indicates a high risk of autism spectrum.
pl: Chcielibyśmy poinformować, że rozwój Twojego Malucha przebiega nietypowo, a wynik badania wskazuje wysokie ryzyka wystąpienia u niego spektrum autyzmu.

# noRiskParagraph
source: Please remember, that the M-CHAT-R questionnaire is only a preliminary screening test and not a diagnostic tool. If you are still concerned about your child's development, please contact a specialist.
pl: Pamiętaj jednak, że kwestionariusz M-CHAT-R jest jedynie wstępnym badaniem przesiewowym, a nie narzędziem diagnostycznym. Jeśli mimo wszystko niepokoi Cię rozwój Twojego dziecka, skontaktuj się ze specjalistą.

# smallRiskParagraph
source: Please remember, that the M-CHAT-R questionnaire is only a preliminary screening test and not a diagnostic tool. Therefore, it would be important for you to get in touch with a specialist. In some cases, after such a conversation, it turns out that there is no reason to worry about the child's development, while in others, a specialized consultation or diagnosis for the child is needed.
pl: Pamiętaj jednak, że kwestionariusz M-CHAT-R jest jedynie wstępnym badaniem przesiewowym, a nie narzędziem diagnostycznym. Dlatego byłoby ważne, abyś skontaktował się ze specjalistą. W niektórych przypadkach po takiej rozmowie okazuje się, że nie ma powodów do niepokoju o rozwój dziecka, a w innych, że potrzebna jest jednak specjalistyczna konsultacja lub diagnoza dziecka.

# bigRiskParagraph
source: Please remember, that the M-CHAT-R questionnaire is only a preliminary screening test and not a diagnostic tool. Therefore, it is very important that you consult with a specialist who deals with diagnosing autism spectrum disorders in young children. During the conversation, you will clarify your doubts, receive advice, and get guidance on further actions.
pl: Pamiętaj jednak, że kwestionariusz M-CHAT-R jest jedynie wstępnym badaniem przesiewowym, a nie narzędziem diagnostycznym. Dlatego bardzo ważne jest, abyś konsultował się ze specjalistą zajmującym się diagnozowaniem spektrum autyzmu u małych dzieci. Podczas rozmowy wyjaśnisz swoje wątpliwości, uzyskasz poradę oraz wskazówki odnośnie dalszych działań.

# surveyId
source: Your survey ID taken on
pl: Identyfikator Twojego badania wykonanego

# advancedSurveyButton
source: Take the M-CHAT R/F survey
pl: Wykonaj badanie uszczegóławiające M-CHAT R/F

# noRiskAction1
source: Please remember
pl: Pamiętaj:

# noRiskAction2
source: If your child has not yet reached 24 months of age at the time of the assessment, it is recommended to fill out the M-CHAT-R questionnaire again between 24 and 30 months of age.
pl: Jeśli Twoje dziecko w chwili badania nie ukończyło jeszcze 24 miesięcy, zalecane jest powtórne wypełnienie kwestionariusza M-CHAT-R pomiędzy 24 a 30 miesiącem życia.

# noRiskAction3
source: You can use the free tele-advice service under the contract with NFZ (National Health Fund). To arrange an appointment, please fill out the survey: https://ankieta.synapsis.waw.pl/ankieta/
pl: Możesz skorzystać z bezpłatnej teleporady w ramach kontraktu z NFZ. W celu umówienia się wypełnij ankietę: https://ankieta.synapsis.waw.pl/ankieta/

# noRiskAction4
source: For more information about the skills that a child should have at this age and supporting their development, visit the website http://badabada.pl/dla-rodzicow/rozwoj-dziecka
pl: Więcej informacji na temat umiejętności, które dziecko w tym wieku powinno posiadać oraz wspierania jego rozwoju znajdziesz na stronie http://badabada.pl/dla-rodzicow/rozwoj-dziecka

# smallRiskAction1
source: What you can do now:
pl: Co możesz teraz zrobić:

# smallRiskAction2
source: Fill out the second part of the assessment, M-CHAT-R/F, where you will find more detailed questions. After completing it, it will be more likely to determine whether further specialized diagnosis for autism spectrum is needed or if the obtained result is not concerning.
pl: Wypełnij drugą badania, M-CHAT-R/F, w której znajdziesz pytania uszczegóławiające. Po jego wypełnieniu z większym prawdopodobieństwem można ocenić, czy wskazana jest dalsza specjalistyczna diagnoza w kierunku spektrum autyzmu, czy jednak uzyskany wynik nie jest niepokojący

# smallRiskAction3
source: Contact a specialist (doctor, psychologist, educator) to discuss and explain the assessment results and clarify your doubts.
pl: Skontaktuj się ze specjalistą (lekarzem, psychologiem, pedagogiem), aby porozmawiać i omówić wyniki badania oraz wyjaśnić swoje wątpliwości

# smallRiskAction4
source: Use the free tele-advice service under the contract with NFZ (National Health Fund). To arrange an appointment, please fill out the survey: https://ankieta.synapsis.waw.pl/ankieta/
pl: Skorzystaj z bezpłatnej teleporady w ramach kontraktu z NFZ. W celu umówienia się wypełnij ankietę: https://ankieta.synapsis.waw.pl/ankieta/

# smallRiskAction5
source: For more information about the skills that a child should have at this age and supporting their development, visit the website http://badabada.pl/dla-rodzicow/rozwoj-dziecka
pl: Więcej informacji na temat umiejętności, które dziecko w tym wieku powinno posiadać oraz wspierania jego rozwoju znajdziesz na stronie http://badabada.pl/dla-rodzicow/rozwoj-dziecka

# bigRiskAction1
source: What1 you can do now:
pl: Co możesz teraz zrobić:

# bigRiskAction2
source: If you want to obtain more information about your child's development, fill out the second part of the assessment, where you will find more detailed questions.
pl: Jeśli chcesz uzyskać więcej informacji o rozwoju swojego dziecka, wypełnij drugą część badania, w której znajdziesz pytania uszczegóławiające

# bigRiskAction3
source: Contact a specialist who deals with diagnosing autism spectrum disorders in young children to discuss and explain the assessment results and clarify your doubts.
pl: Skontaktuj się ze specjalistą zajmującym się diagnozowaniem spektrum autyzmu u małych dzieci, aby porozmawiać i omówić wyniki badania oraz wyjaśnić swoje wątpliwości

# bigRiskAction4
source: Use the free tele-advice service under the contract with NFZ (National Health Fund). To arrange an appointment, please fill out the survey: https://ankieta.synapsis.waw.pl/ankieta/
pl: Skorzystaj z bezpłatnej teleporady w ramach kontraktu z NFZ. W celu umówienia się wypełnij ankietę: https://ankieta.synapsis.waw.pl/ankieta/

# bigRiskAction5
source: While waiting for the consultation with a specialist or diagnosis: keep notes on the skills and behaviors exhibited by your child that concern you, record your child during playtime, interacting with close relatives and other children, and reach out to your local Psychological-Pedagogical Counseling Center.
pl: W oczekiwaniu na konsultację ze specjalistą lub diagnozę: prowadź notatki o zdobywanych przez dziecko umiejętnościach i zachowaniach, które Cię niepokoją, nagrywaj swoje dziecko podczas zabawy, w kontakcie z osobami bliskimi i innymi dziećmi, zgłoś się do swojej rejonowej Poradni Psychologiczno-Pedagogicznej

# bigRiskAction6
source: For more information about the skills that a child should have at this age and supporting their development, visit the website http://badabada.pl/dla-rodzicow/rozwoj-dziecka
pl: Więcej informacji na temat umiejętności, które dziecko w tym wieku powinno posiadać oraz wspierania jego rozwoju znajdziesz na stronie http://badabada.pl/dla-rodzicow/rozwoj-dziecka

# dearParent
source: Dear parent, your child's score is:
pl: Drogi rodzicu, wynik Twojego dziecka to:

source: points
pl: punktów

source: Download results
pl: Pobierz wyniki

# negativeIntro
source: Your child received a negative result.
pl: Twoje dziecko otrzymało wynik ujemny.

# positiveIntro
source: Your child received a positive result.
pl: Twoje dziecko otrzymało wynik dodatni.

# negativeParagraph
source: If you suspect that your child may have ASD, it should undergo further evaluation, regardless of the test result.
pl: Jeśli masz podejrzenia, że Twoje dziecko może mieć ASD, powinno ono zostać poddane dalszej ocenie, niezależnie od wyniku badania.

# positiveParagraph
source: Immediate referral for early intervention and diagnostic tests is recommended.
pl: Zaleca się niezwłoczne skierowanie go na wczesną interwencję i testy diagnostyczne.

# negativeActions1
source: Remember:
pl: Pamiętaj:

# negativeActions2
source: If your child has not yet turned 24 months at the time of the assessment, it is recommended to complete the M-CHAT-R questionnaire again between 24 and 30 months of age.
pl: Jeśli Twoje dziecko w chwili badania nie ukończyło jeszcze 24 miesięcy, zalecane jest powtórne wypełnienie kwestionariusza M-CHAT-R pomiędzy 24 a 30 miesiącem życia.

# negativeActions3
source: You can take advantage of a free teleconsultation under the NFZ contract. To schedule, please fill out the questionnaire: https://ankieta.synapsis.waw.pl/ankieta/
pl: Możesz skorzystać z bezpłatnej teleporady w ramach kontraktu z NFZ. W celu umówienia się wypełnij ankietę: https://ankieta.synapsis.waw.pl/ankieta/

# negativeActions4
source: More information about the skills that a child should have at this age and supporting its development can be found at: http://badabada.pl/dla-rodzicow/rozwoj-dziecka
pl: Więcej informacji na temat umiejętności, które dziecko w tym wieku powinno posiadać oraz wspierania jego rozwoju znajdziesz na stronie http://badabada.pl/dla-rodzicow/rozwoj-dziecka

# positiveActions1
source: What you can do now:
pl: Co możesz teraz zrobić:

# positiveActions2
source: Contact a specialist who deals with diagnosing autism spectrum disorders in young children to discuss and clarify the test results and address your concerns.
pl: Skontaktuj się ze specjalistą zajmującym się diagnozowaniem spektrum autyzmu u małych dzieci, aby porozmawiać i omówić wyniki badania oraz wyjaśnić swoje wątpliwości

# positiveActions3
source: You can take advantage of a free teleconsultation under the NFZ contract. To schedule, please fill out the questionnaire: https://ankieta.synapsis.waw.pl/ankieta/
pl: Skorzystaj z bezpłatnej teleporady w ramach kontraktu z NFZ. W celu umówienia się wypełnij ankietę: https://ankieta.synapsis.waw.pl/ankieta/

# positiveActions4
source: While waiting for the consultation with a specialist or diagnosis: take notes on your child's acquired skills and behaviors that concern you, record your child during playtime, interactions with close people, and other children, and reach out to your local Psychological-Pedagogical Counseling Center.
pl: W oczekiwaniu na konsultację ze specjalistą lub diagnozę: prowadź notatki o zdobywanych przez dziecko umiejętnościach i zachowaniach, które Cię niepokoją, nagrywaj swoje dziecko podczas zabawy, w kontakcie z osobami bliskimi i innymi dziećmi, zgłoś się do swojej rejonowej Poradni Psychologiczno-Pedagogicznej

# positiveActions5
source: More information about the skills that a child should have at this age and supporting its development can be found at: http://badabada.pl/dla-rodzicow/rozwoj-dziecka
pl: Więcej informacji na temat umiejętności, które dziecko w tym wieku powinno posiadać oraz wspierania jego rozwoju znajdziesz na stronie http://badabada.pl/dla-rodzicow/rozwoj-dziecka

# positiveResult
source: Result is positive
pl: Wynik jest dodatni

# negativeResult
source: Result is negative
pl: Wynik jest ujemny

# singlePoint
source: point
pl: punkt

# points2
source: points
pl: punkty
